/****************************************Copyright (c)****************************************************
**                            Guangzhou ZHIYUAN electronics Co.,LTD.
**                                      
**                                 http://www.embedtools.com
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               Led.h
** Latest modified Date:    2007-11-19
** Latest Version:          1.0
** Descriptions:            LED驱动程序头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              LiZhenming
** Created date:            2007-11-19
** Version:                 1.0
** Descriptions:            The original version
**
**--------------------------------------------------------------------------------------------------------
** Modified by:             
** Modified date:           
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#ifndef __LED_DRIVER_H
#define __LED_DRIVER_H

/*********************************************************************************************************
定义IO控制码
*********************************************************************************************************/
#define     LED1_ON         1                                           /*  点亮LED1                    */
#define     LED1_OFF        2                                           /*  熄灭LED1                    */
#define     LED2_ON         3                                           /*  点亮LED2                    */
#define     LED2_OFF        4                                           /*  熄灭LED2                    */
#define     LED1_GET_STATUS 5                                           /*  获取LED1状态                */
#define     LED2_GET_STATUS 6                                           /*  获取LED2状态                */






#endif