// 下列 ifdef 块是创建使从 DLL 导出更简单的
// 宏的标准方法。此 DLL 中的所有文件都是用命令行上定义的 DLT645_EXPORTS
// 符号编译的。在使用此 DLL 的
// 任何其他项目上不应定义此符号。这样，源文件中包含此文件的任何其他项目都会将
// DLT645_API 函数视为是从 DLL 导入的，而此 DLL 则将用此宏定义的
// 符号视为是被导出的。
#ifdef DLT645_EXPORTS
#define DLT645_API __declspec(dllexport)
#else
#define DLT645_API __declspec(dllimport)
#endif


//1.1
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ReadData1
** 功能描述:		读数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ReadData1(BYTE *pAddr, BYTE *pDI, BYTE *pReadBuff);

//1.2
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ReadData2
** 功能描述:		读指定块数数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
**					N				负荷记录块数(1字节)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ReadData2(BYTE *pAddr, BYTE *pDI, BYTE *pReadBuff, BYTE N);

//1.3
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ReadData3
** 功能描述:		读指定时间、指定块数数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
**					*pTime			时间指针(5字节时间,mmhhDDMMYY)
**					N				负荷记录块数(1字节)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ReadData3(BYTE *pAddr, BYTE *pDI, BYTE *pReadBuff, BYTE *pTime, BYTE N);

//2
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ReadDataNext
** 功能描述:		读后续数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
**					SEQ				帧序号
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ReadDataNext(BYTE *pAddr, BYTE *pDI, BYTE SEQ, BYTE *pReadBuff);

//3
/*********************************************************************************************************
** 函数名称:		DLT645_2007_WriteData
** 功能描述:		写数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
**					*pPassword		密钥指针(4字节密钥)
**					*pConsumer		操作者码(4字节操作者码)
**					*pWriteData		写入数据指针
**					len				写入数据个数
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_WriteData(BYTE *pAddr, BYTE *pDI, BYTE *pPassword, BYTE *pConsumer, BYTE *pWriteData, BYTE len);

//4
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ReadAddr
** 功能描述:		读通信地址                        
** 输入参数:        *pAddr			输出地址指针(6字节地址)
** 输出参数:		*pAddr			输出地址指针(6字节地址)
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ReadAddr(BYTE *pAddr);

//5
/*********************************************************************************************************
** 函数名称:		DLT645_2007_WriteAddr
** 功能描述:		写通信地址                        
** 输入参数:        *pAddr			地址指针(6字节地址)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_WriteAddr(BYTE *pAddr);

//6
/*********************************************************************************************************
** 函数名称:		DLT645_2007_BroadcastTime
** 功能描述:		广播校时                        
** 输入参数:        *pTime			时间指针(6字节时间,ssmmhhDDMMYY)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_BroadcastTime(BYTE *pTime);

//7
/*********************************************************************************************************
** 函数名称:		DLT645_2007_Freeze
** 功能描述:		冻结命令                        
** 输入参数:        *pAddr			地址指针(6字节地址)
*pTime			时间指针(4字节时间,mmhhDDMM)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_Freeze(BYTE *pAddr, BYTE *pTime);

//8
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ChangeBaudrate
** 功能描述:		更改通信速率                       
** 输入参数:        *pAddr			地址指针(6字节地址)
**					Z				通信速率特征字
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ChangeBaudrate(BYTE *pAddr, BYTE Z);

//9
/*********************************************************************************************************
** 函数名称:		DLT645_2007_ChangePassword
** 功能描述:		更改密码                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(4字节数据标识符)
**					*pPasswordOld	旧密钥指针(4字节密钥)
**					*pPasswordNew	新密钥指针(4字节密钥)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_ChangePassword(BYTE *pAddr, BYTE *pDI, BYTE *pPasswordOld, BYTE *pPasswordNew);

//10
/*********************************************************************************************************
** 函数名称:		DLT645_2007_CleanMaxRequire
** 功能描述:		最大需量清零                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pPassword		密钥指针(4字节密钥)
**					*pConsumer		操作者码(4字节操作者码)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_CleanMaxRequire(BYTE *pAddr, BYTE *pPassword, BYTE *pConsumer);

//11
/*********************************************************************************************************
** 函数名称:		DLT645_2007_CleanAllData
** 功能描述:		电表清零                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pPassword		密钥指针(4字节密钥)
**					*pConsumer		操作者码(4字节操作者码)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_CleanAllData(BYTE *pAddr,BYTE *pPassword, BYTE *pConsumer);

//12
/*********************************************************************************************************
** 函数名称:		DLT645_2007_CleanMaxRequire
** 功能描述:		事件清零                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pPassword		密钥指针(4字节密钥)
**					*pConsumer		操作者码(4字节操作者码)
**					*pData			数据指针
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_2007_CleanEvent(BYTE *pAddr,BYTE *pPassword, BYTE *pConsumer,BYTE *pData);

//13
/*********************************************************************************************************
** 函数名称:		DLT645_OpenPort
** 功能描述:		打开串口                        
** 输入参数:        com				串口号
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_OpenPort(int com);

//14
/*********************************************************************************************************
** 函数名称:		DLT645_ClosePort
** 功能描述:		关闭串口                        
** 输入参数:        com				串口号
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_ClosePort(int com);

//15
/*********************************************************************************************************
** 函数名称:		DLT645_GetDllVersion
** 功能描述:		读动态库版本号                        
** 输入参数:        无
** 输出参数:		NONE
** 返回数值:		返回动态库版本号.
*********************************************************************************************************/
extern "C" DLT645_API int DLT645_GetDllVersion(void);

//1
/*********************************************************************************************************
** 函数名称:		DLT645_1997_ReadData
** 功能描述:		读数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(2字节数据标识符)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_ReadData(BYTE *pAddr, BYTE *pDI, BYTE *pReadBuff);

//2
/*********************************************************************************************************
** 函数名称:		DLT645_1997_ReadDataNext
** 功能描述:		读后续数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(2字节数据标识符)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_ReadDataNext(BYTE *pAddr, BYTE *pDI, BYTE *pReadBuff);

//3
/*********************************************************************************************************
** 函数名称:		DLT645_1997_ReReReadData
** 功能描述:		重读数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
** 输出参数:		*pReadBuff		输出数据指针
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_ReReadData(BYTE *pAddr, BYTE *pReadBuff);

//4
/*********************************************************************************************************
** 函数名称:		DLT645_1997_WriteData
** 功能描述:		写数据                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pDI			数据标识符指针(2字节数据标识符)
**					*pWriteData		写入数据指针
**					len				写入数据个数
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_WriteData(BYTE *pAddr, BYTE *pDI, BYTE *pWriteData, BYTE len);

//5
/*********************************************************************************************************
** 函数名称:		DLT645_1997_BroadcastTime
** 功能描述:		广播校时                        
** 输入参数:        *pTime			时间指针(6字节时间)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_BroadcastTime(BYTE *pTime);

//6
/*********************************************************************************************************
** 函数名称:		DLT645_1997_WriteAddr
** 功能描述:		写通信地址                        
** 输入参数:        *pAddr			地址指针(6字节地址)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_WriteAddr(BYTE *pAddr);

//7
/*********************************************************************************************************
** 函数名称:		DLT645_1997_ChangeBaudrate
** 功能描述:		更改通信速率                       
** 输入参数:        *pAddr			地址指针(6字节地址)
**					Z				通信速率特征字
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_ChangeBaudrate(BYTE *pAddr, BYTE Z);

//8
/*********************************************************************************************************
** 函数名称:		DLT645_1997_ChangePassword
** 功能描述:		更改密码                        
** 输入参数:        *pAddr			地址指针(6字节地址)
**					*pPasswordOld	旧密钥指针(4字节密钥)
**					*pPasswordNew	新密钥指针(4字节密钥)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_ChangePassword(BYTE *pAddr, BYTE *pPasswordOld, BYTE *pPasswordNew);

//9
/*********************************************************************************************************
** 函数名称:		DLT645_1997_CleanMaxRequire
** 功能描述:		最大需量清零                        
** 输入参数:        *pAddr			地址指针(6字节地址)
** 输出参数:		NONE
** 返回数值:		操作成功返回TRUE, 操作失败返回FALSE.
*********************************************************************************************************/
extern "C" DLT645_API BOOL DLT645_1997_CleanMaxRequire(BYTE *pAddr);